       identification division.
       program-id. backUrubu.

       data division.
       working-storage section.
           
           01 user-value        PIC 9(5)V99.
           01 result            PIC 9(7)V99.
           01 calc-value        PIC 9(7)V99.
           01 calc-final        PIC 9(7)V99.
           01 ARGUMENTO         PIC X(20).
           01 VALOR-NUM         PIC 9(5)V99.
